<h1>Table of Contents<span class="tocSkip"></span></h1>
<div class="toc"><ul class="toc-item"><li><span><a href="#Pandas-Serileri" data-toc-modified-id="Pandas-Serileri-1"><span class="toc-item-num">1&nbsp;&nbsp;</span>Pandas Serileri</a></span><ul class="toc-item"><li><span><a href="#Sozluklerden-Pandas-serisi-olusturmak" data-toc-modified-id="Sozluklerden-Pandas-serisi-olusturmak-1.1"><span class="toc-item-num">1.1&nbsp;&nbsp;</span><strong>Sozluklerden Pandas serisi olusturmak</strong></a></span></li></ul></li><li><span><a href="#Data-Frames" data-toc-modified-id="Data-Frames-2"><span class="toc-item-num">2&nbsp;&nbsp;</span>Data Frames</a></span><ul class="toc-item"><li><span><a href="#Sutunlari-Cagirmak?" data-toc-modified-id="Sutunlari-Cagirmak?-2.1"><span class="toc-item-num">2.1&nbsp;&nbsp;</span>Sutunlari Cagirmak?</a></span><ul class="toc-item"><li><span><a href="#Kisa-yol" data-toc-modified-id="Kisa-yol-2.1.1"><span class="toc-item-num">2.1.1&nbsp;&nbsp;</span>Kisa yol</a></span></li></ul></li><li><span><a href="#Satirlari-Cagirmak-,-loc-(location)" data-toc-modified-id="Satirlari-Cagirmak-,-loc-(location)-2.2"><span class="toc-item-num">2.2&nbsp;&nbsp;</span>Satirlari Cagirmak , loc (location)</a></span></li><li><span><a href="#Sutun-Eklemek" data-toc-modified-id="Sutun-Eklemek-2.3"><span class="toc-item-num">2.3&nbsp;&nbsp;</span>Sutun Eklemek</a></span></li><li><span><a href="#Sutun-Cikartmak-,-drop()" data-toc-modified-id="Sutun-Cikartmak-,-drop()-2.4"><span class="toc-item-num">2.4&nbsp;&nbsp;</span>Sutun Cikartmak , drop()</a></span></li><li><span><a href="#iloc()" data-toc-modified-id="iloc()-2.5"><span class="toc-item-num">2.5&nbsp;&nbsp;</span>iloc()</a></span></li><li><span><a href="#Peki-tek-bir-elemana-erismek?" data-toc-modified-id="Peki-tek-bir-elemana-erismek?-2.6"><span class="toc-item-num">2.6&nbsp;&nbsp;</span>Peki tek bir elemana erismek?</a></span></li></ul></li><li><span><a href="#DataFrame-Filtreleme" data-toc-modified-id="DataFrame-Filtreleme-3"><span class="toc-item-num">3&nbsp;&nbsp;</span>DataFrame Filtreleme</a></span></li><li><span><a href="#Indexleri-Degistirme" data-toc-modified-id="Indexleri-Degistirme-4"><span class="toc-item-num">4&nbsp;&nbsp;</span>Indexleri Degistirme</a></span></li><li><span><a href="#DataFramelerde-Multi-Index-Tanimlama" data-toc-modified-id="DataFramelerde-Multi-Index-Tanimlama-5"><span class="toc-item-num">5&nbsp;&nbsp;</span>DataFramelerde Multi-Index Tanimlama</a></span><ul class="toc-item"><li><span><a href="#Gruplari-ve-Indexleri-Isimlendirmek" data-toc-modified-id="Gruplari-ve-Indexleri-Isimlendirmek-5.1"><span class="toc-item-num">5.1&nbsp;&nbsp;</span>Gruplari ve Indexleri Isimlendirmek</a></span><ul class="toc-item"><li><span><a href="#xs-metodu" data-toc-modified-id="xs-metodu-5.1.1"><span class="toc-item-num">5.1.1&nbsp;&nbsp;</span>xs metodu</a></span></li></ul></li></ul></li><li><span><a href="#Missing-Value'lar-Ile-Ugrasma" data-toc-modified-id="Missing-Value'lar-Ile-Ugrasma-6"><span class="toc-item-num">6&nbsp;&nbsp;</span>Missing Value'lar Ile Ugrasma</a></span><ul class="toc-item"><li><span><a href="#dropna()" data-toc-modified-id="dropna()-6.1"><span class="toc-item-num">6.1&nbsp;&nbsp;</span>dropna()</a></span></li><li><span><a href="#fillna()" data-toc-modified-id="fillna()-6.2"><span class="toc-item-num">6.2&nbsp;&nbsp;</span>fillna()</a></span><ul class="toc-item"><li><span><a href="#size()-,-sum()-,-isnull()" data-toc-modified-id="size()-,-sum()-,-isnull()-6.2.1"><span class="toc-item-num">6.2.1&nbsp;&nbsp;</span>size() , sum() , isnull()</a></span></li></ul></li></ul></li><li><span><a href="#GroupBy-Operasyonlari" data-toc-modified-id="GroupBy-Operasyonlari-7"><span class="toc-item-num">7&nbsp;&nbsp;</span>GroupBy Operasyonlari</a></span><ul class="toc-item"><li><span><a href="#count()" data-toc-modified-id="count()-7.1"><span class="toc-item-num">7.1&nbsp;&nbsp;</span>count()</a></span></li><li><span><a href="#max()" data-toc-modified-id="max()-7.2"><span class="toc-item-num">7.2&nbsp;&nbsp;</span>max()</a></span></li><li><span><a href="#mean()" data-toc-modified-id="mean()-7.3"><span class="toc-item-num">7.3&nbsp;&nbsp;</span>mean()</a></span></li></ul></li><li><span><a href="#Concatenation" data-toc-modified-id="Concatenation-8"><span class="toc-item-num">8&nbsp;&nbsp;</span>Concatenation</a></span></li><li><span><a href="#Join" data-toc-modified-id="Join-9"><span class="toc-item-num">9&nbsp;&nbsp;</span>Join</a></span></li><li><span><a href="#Merge" data-toc-modified-id="Merge-10"><span class="toc-item-num">10&nbsp;&nbsp;</span>Merge</a></span><ul class="toc-item"><li><span><a href="#Join-ve-Merge-Farki" data-toc-modified-id="Join-ve-Merge-Farki-10.1"><span class="toc-item-num">10.1&nbsp;&nbsp;</span>Join ve Merge Farki</a></span></li></ul></li><li><span><a href="#DataFrame-Operasyonari" data-toc-modified-id="DataFrame-Operasyonari-11"><span class="toc-item-num">11&nbsp;&nbsp;</span>DataFrame Operasyonari</a></span><ul class="toc-item"><li><span><a href="#head()" data-toc-modified-id="head()-11.1"><span class="toc-item-num">11.1&nbsp;&nbsp;</span>head()</a></span></li><li><span><a href="#unique()-ve-nunique()" data-toc-modified-id="unique()-ve-nunique()-11.2"><span class="toc-item-num">11.2&nbsp;&nbsp;</span>unique() ve nunique()</a></span></li><li><span><a href="#value_counts()" data-toc-modified-id="value_counts()-11.3"><span class="toc-item-num">11.3&nbsp;&nbsp;</span>value_counts()</a></span></li><li><span><a href="#apply()" data-toc-modified-id="apply()-11.4"><span class="toc-item-num">11.4&nbsp;&nbsp;</span>apply()</a></span><ul class="toc-item"><li><span><a href="#Fonksiyon-ile-Dataframe-guncellemek" data-toc-modified-id="Fonksiyon-ile-Dataframe-guncellemek-11.4.1"><span class="toc-item-num">11.4.1&nbsp;&nbsp;</span>Fonksiyon ile Dataframe guncellemek</a></span></li></ul></li><li><span><a href="#columns-,-index-,-names" data-toc-modified-id="columns-,-index-,-names-11.5"><span class="toc-item-num">11.5&nbsp;&nbsp;</span>columns , index , names</a></span></li><li><span><a href="#sort_values()" data-toc-modified-id="sort_values()-11.6"><span class="toc-item-num">11.6&nbsp;&nbsp;</span>sort_values()</a></span></li></ul></li><li><span><a href="#Pivot-Tables" data-toc-modified-id="Pivot-Tables-12"><span class="toc-item-num">12&nbsp;&nbsp;</span>Pivot Tables</a></span><ul class="toc-item"><li><span><a href="#pivot_table()" data-toc-modified-id="pivot_table()-12.1"><span class="toc-item-num">12.1&nbsp;&nbsp;</span>pivot_table()</a></span></li></ul></li></ul></div>

## Pandas Serileri

In [371]:
import numpy as np
import pandas as pd

In [372]:
labels_list=["Yusuf","Yigit","Irem","Emre","Alp"]
data_list=[10,20,30,40,50]
pd.Series(data=data_list , index=labels_list) 
pd.Series(data_list,labels_list) # Yukaridaki ile ayni

Yusuf    10
Yigit    20
Irem     30
Emre     40
Alp      50
dtype: int64

In [373]:
pd.Series(data_list)

0    10
1    20
2    30
3    40
4    50
dtype: int64

__Numpy Ile olusturmak__

In [374]:
arr=np.array([10,20,30,40,50])

In [375]:
pd.Series(arr)

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [376]:
pd.Series(arr,labels_list)

Yusuf    10
Yigit    20
Irem     30
Emre     40
Alp      50
dtype: int64

In [377]:
pd.Series(data=arr,index=["A","B","C","D","F"])

A    10
B    20
C    30
D    40
F    50
dtype: int64

### __Sozluklerden Pandas serisi olusturmak__

In [378]:
DataDict={"Kadir":30,"Yusuf":40,"Erdem":50,"Mehmet":60}

In [379]:
pd.Series(DataDict)

Kadir     30
Yusuf     40
Erdem     50
Mehmet    60
dtype: int64

In [380]:
ser2020=pd.Series([5,10,14,21],["Bugday","Misir","Kiraz","Erik"])

In [381]:
ser2020

Bugday     5
Misir     10
Kiraz     14
Erik      21
dtype: int64

In [382]:
ser2021=pd.Series([3,11,9],["Bugday","Misir","Erik"])

In [383]:
ser2021

Bugday     3
Misir     11
Erik       9
dtype: int64

In [384]:
ser2020 + ser2021

Bugday     8.0
Erik      30.0
Kiraz      NaN
Misir     21.0
dtype: float64

Kiraz icin toplama yapamadi , Cunku 2021 verilerinde yok.

__Toplamlara Bakmak istersek__

In [385]:
total=ser2020 + ser2021

In [386]:
total

Bugday     8.0
Erik      30.0
Kiraz      NaN
Misir     21.0
dtype: float64

In [387]:
total["Erik"]

30.0

In [388]:
total["Bugday"]

8.0

## Data Frames
```
Init signature:
pd.DataFrame(
    data=None,
    index: 'Axes | None' = None,
    columns: 'Axes | None' = None,
    dtype: 'Dtype | None' = None,
    copy: 'bool | None' = None,
)
```

In [389]:
data1=np.random.randn(3,3) 
data1

array([[ 0.66175827, -0.27295855,  0.17090204],
       [ 0.63840188, -0.74971183, -0.53235218],
       [ 0.11042228,  1.22265577, -0.19953808]])

In [390]:
df = pd.DataFrame(data1,["A","B","C"],columns=["Sutun1","Sutun2","Sutun3"])
df

     Sutun1    Sutun2    Sutun3
A  0.661758 -0.272959  0.170902
B  0.638402 -0.749712 -0.532352
C  0.110422  1.222656 -0.199538

In [391]:
df21 = pd.DataFrame(data1,columns=["Sutun1","Sutun2","Sutun3"]) # Index degeri vermedik [A,B,C]
df21

     Sutun1    Sutun2    Sutun3
0  0.661758 -0.272959  0.170902
1  0.638402 -0.749712 -0.532352
2  0.110422  1.222656 -0.199538

### Sutunlari Cagirmak?

In [392]:
df["Sutun1"]

A    0.661758
B    0.638402
C    0.110422
Name: Sutun1, dtype: float64

In [393]:
type(df["Sutun1"])

pandas.core.series.Series

#### Kisa yol
__Yine sutuna ve bir elemanina Erismek Istersek__

__Kisa Yoldan;__

In [396]:
df.Sutun1

A    0.661758
B    0.638402
C    0.110422
Name: Sutun1, dtype: float64

In [397]:
df.Sutun1["A"]

0.6617582744417273

### Satirlari Cagirmak , loc (location)

__Index Ile sorgulama__

In [398]:
df

     Sutun1    Sutun2    Sutun3
A  0.661758 -0.272959  0.170902
B  0.638402 -0.749712 -0.532352
C  0.110422  1.222656 -0.199538

In [399]:
df.loc["A"]

Sutun1    0.661758
Sutun2   -0.272959
Sutun3    0.170902
Name: A, dtype: float64

In [400]:
df[["Sutun1","Sutun3"]]

     Sutun1    Sutun3
A  0.661758  0.170902
B  0.638402 -0.532352
C  0.110422 -0.199538

### Sutun Eklemek

In [401]:
df["Sutun4"] = pd.Series(np.random.randn(3),["A","B","C"])

In [402]:
df

     Sutun1    Sutun2    Sutun3    Sutun4
A  0.661758 -0.272959  0.170902  1.044685
B  0.638402 -0.749712 -0.532352 -0.342263
C  0.110422  1.222656 -0.199538 -1.372184

In [405]:
# Pd Series falan ugrasmak istemessek?
df_11=pd.DataFrame(np.random.randn(4,3),columns = ["Col1","Col2","Col3"])
df_11

       Col1      Col2      Col3
0  0.623265 -1.692909 -0.684116
1  0.975052  1.183641  2.007154
2 -0.404944 -0.160279 -1.363607
3  0.960110  2.222068  0.792578

In [406]:
df_11["Col4"]=np.random.randn(4)
df_11

       Col1      Col2      Col3      Col4
0  0.623265 -1.692909 -0.684116 -2.210835
1  0.975052  1.183641  2.007154 -0.573858
2 -0.404944 -0.160279 -1.363607  0.210179
3  0.960110  2.222068  0.792578 -0.600855

__Sutun1 , Sutun2 , Sutun 3 ve Sutun 4 'un toplamini Toplam olarak Toplamak Istiyorum?__

In [407]:
df["Toplam"] = df["Sutun1"] + df["Sutun2"] + df["Sutun3"] + df["Sutun4"] 

# Veya df["Toplam"] = df.Sutun1 + df.Sutun2

In [408]:
df

     Sutun1    Sutun2    Sutun3    Sutun4    Toplam
A  0.661758 -0.272959  0.170902  1.044685  1.604387
B  0.638402 -0.749712 -0.532352 -0.342263 -0.985926
C  0.110422  1.222656 -0.199538 -1.372184 -0.238644

__Direkt Deger olarak ' da Girebiliriz__

In [340]:
df["Col4"]=["NewValue1","NewValue2","NewValue3"]
df

     Sutun1    Sutun2    Sutun3    Sutun4    Toplam       Col4
A  0.912282  0.901061  0.000387 -0.387156  1.426575  NewValue1
B -1.342005  1.179429 -0.206496 -0.790948 -1.160019  NewValue2
C  0.540118  0.523578  0.305036 -1.993200 -0.624469  NewValue3

### Sutun Cikartmak , drop()

In [341]:
df.drop("Toplam",axis=1) # Default olarak Axis 0 da arar.

     Sutun1    Sutun2    Sutun3    Sutun4       Col4
A  0.912282  0.901061  0.000387 -0.387156  NewValue1
B -1.342005  1.179429 -0.206496 -0.790948  NewValue2
C  0.540118  0.523578  0.305036 -1.993200  NewValue3

In [342]:
df # Silmis fakat guncellememis .

     Sutun1    Sutun2    Sutun3    Sutun4    Toplam       Col4
A  0.912282  0.901061  0.000387 -0.387156  1.426575  NewValue1
B -1.342005  1.179429 -0.206496 -0.790948 -1.160019  NewValue2
C  0.540118  0.523578  0.305036 -1.993200 -0.624469  NewValue3

Shift + tab ---> ile baktigimizda , inplace = False . Yani default olarak guncellemiyor. 

o halde ;

In [343]:
df.drop("Toplam",axis=1,inplace=True)

In [344]:
df

     Sutun1    Sutun2    Sutun3    Sutun4       Col4
A  0.912282  0.901061  0.000387 -0.387156  NewValue1
B -1.342005  1.179429 -0.206496 -0.790948  NewValue2
C  0.540118  0.523578  0.305036 -1.993200  NewValue3

### iloc()

In [345]:
df.iloc[0]

Sutun1     0.912282
Sutun2     0.901061
Sutun3     0.000387
Sutun4    -0.387156
Col4      NewValue1
Name: A, dtype: object

In [346]:
df.loc["A"]

Sutun1     0.912282
Sutun2     0.901061
Sutun3     0.000387
Sutun4    -0.387156
Col4      NewValue1
Name: A, dtype: object

Demekki bizim indexlerimiz A  , B , C -----> 0 , 1 , 2 olarak tutuluyormus.

### Peki tek bir elemana erismek?

In [347]:
df.loc["A","Sutun1"]

0.9122823402147877

In [348]:
df.loc[["A","B"],["Sutun1","Sutun2"]]

     Sutun1    Sutun2
A  0.912282  0.901061
B -1.342005  1.179429

## DataFrame Filtreleme

In [349]:
from numpy.random import randn

In [350]:
df= pd.DataFrame(randn(4,3),["A","B","C","D"],["Col1","Col2","Col3"])
df

       Col1      Col2      Col3
A  0.536233  1.361770  0.281400
B  1.007868 -0.603010 -0.158797
C -0.791084  0.768673 -0.003939
D -0.567482  0.559103  0.322642

In [351]:
df > 0

    Col1   Col2   Col3
A   True   True   True
B   True  False  False
C  False   True  False
D  False   True   True

In [352]:
flt = (df > 0 )
df[flt] # False olanlar NaN:Not an Number geldi .

       Col1      Col2      Col3
A  0.536233  1.361770  0.281400
B  1.007868       NaN       NaN
C       NaN  0.768673       NaN
D       NaN  0.559103  0.322642

Kendi Icindede filtreleyebiliriz

In [353]:
df[df > 0]

       Col1      Col2      Col3
A  0.536233  1.361770  0.281400
B  1.007868       NaN       NaN
C       NaN  0.768673       NaN
D       NaN  0.559103  0.322642

In [354]:
df.Col1

A    0.536233
B    1.007868
C   -0.791084
D   -0.567482
Name: Col1, dtype: float64

In [355]:
df.Col1 > 0

A     True
B     True
C    False
D    False
Name: Col1, dtype: bool

In [356]:
df[df.Col1>0] # Col 1 icin 0 dan Kucuk Satirlari Elimine Etti

       Col1     Col2      Col3
A  0.536233  1.36177  0.281400
B  1.007868 -0.60301 -0.158797

In [357]:
df[df.Col3>0]  # Col 3 icin 0 Dan kucunleri elimine etti

       Col1      Col2      Col3
A  0.536233  1.361770  0.281400
D -0.567482  0.559103  0.322642

In [358]:
# Yukaridaki ile Ayni
df[df["Col3"]>0]

       Col1      Col2      Col3
A  0.536233  1.361770  0.281400
D -0.567482  0.559103  0.322642

__D Ortak geldi O halde bu ikisini and ile birlestirebiliriz__

In [359]:
df[(df.Col1>0) & (df.Col3>0 )] # iki Kosuluda saglayan D indexi var .

       Col1     Col2    Col3
A  0.536233  1.36177  0.2814

## Indexleri Degistirme
```
df.set_index(
    keys,
    drop: 'bool' = True,
    append: 'bool' = False,
    inplace: 'bool' = False,
    verify_integrity: 'bool' = False,
)
```

In [424]:
df=pd.DataFrame(randn(3,3),columns=["Col1","Col2","Col3"])
df

       Col1      Col2      Col3
0 -0.822034 -2.050028 -0.106310
1  0.784637  0.293295 -0.505096
2  0.968877  0.283424  0.570155

In [425]:
# Column ekleyelim
df["Col4"]=["NewVal1","NewVal2","NewVal3"]
df

       Col1      Col2      Col3     Col4
0 -0.822034 -2.050028 -0.106310  NewVal1
1  0.784637  0.293295 -0.505096  NewVal2
2  0.968877  0.283424  0.570155  NewVal3

In [427]:
df.set_index("Col4")

             Col1      Col2      Col3
Col4
NewVal1 -0.822034 -2.050028 -0.106310
NewVal2  0.784637  0.293295 -0.505096
NewVal3  0.968877  0.283424  0.570155

In [429]:
df # Guncellememis O Halde ....

       Col1      Col2      Col3     Col4
0 -0.822034 -2.050028 -0.106310  NewVal1
1  0.784637  0.293295 -0.505096  NewVal2
2  0.968877  0.283424  0.570155  NewVal3

In [430]:
df.set_index("Col4",inplace = True)

In [431]:
df

             Col1      Col2      Col3
Col4
NewVal1 -0.822034 -2.050028 -0.106310
NewVal2  0.784637  0.293295 -0.505096
NewVal3  0.968877  0.283424  0.570155

In [433]:
df.index.names # Bu Sekilde Indexlerin isimlerini Gorebiliriz

FrozenList(['Col4'])

## DataFramelerde Multi-Index Tanimlama

In [441]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [442]:
outerIndex=["Group1","Group1","Group1","Group2","Group2","Group2","Group3","Group3","Group3"]

In [443]:
innerIndex=["Index1","Index2","Index3","Index1","Index2","Index3","Index1","Index2","Index3"]

In [445]:
list(zip(outerIndex,innerIndex))

[('Group1', 'Index1'),
 ('Group1', 'Index2'),
 ('Group1', 'Index3'),
 ('Group2', 'Index1'),
 ('Group2', 'Index2'),
 ('Group2', 'Index3'),
 ('Group3', 'Index1'),
 ('Group3', 'Index2'),
 ('Group3', 'Index3')]

In [446]:
hierarchy = list(zip(outerIndex,innerIndex))

In [447]:
hierarchy=pd.MultiIndex.from_tuples(hierarchy)

In [448]:
hierarchy

MultiIndex([('Group1', 'Index1'),
            ('Group1', 'Index2'),
            ('Group1', 'Index3'),
            ('Group2', 'Index1'),
            ('Group2', 'Index2'),
            ('Group2', 'Index3'),
            ('Group3', 'Index1'),
            ('Group3', 'Index2'),
            ('Group3', 'Index3')],
           )

In [455]:
df = pd.DataFrame(randn(9,3) , index=hierarchy , columns=["Column1","Column2","Column3"])
df

                Column1   Column2   Column3
Group1 Index1  0.536285  0.705008  0.563368
       Index2 -0.174463 -0.433609  0.297974
       Index3  0.515365  0.072579  0.155913
Group2 Index1 -0.184838  0.621767 -0.196483
       Index2  0.392498 -1.167629 -0.780492
       Index3 -1.147811  0.187292  0.054348
Group3 Index1 -0.687919 -1.133465 -0.456514
       Index2  0.006300  1.214188 -0.903092
       Index3 -0.658737 -1.056317 -0.313451

In [456]:
df.Column1

Group1  Index1    0.536285
        Index2   -0.174463
        Index3    0.515365
Group2  Index1   -0.184838
        Index2    0.392498
        Index3   -1.147811
Group3  Index1   -0.687919
        Index2    0.006300
        Index3   -0.658737
Name: Column1, dtype: float64

In [457]:
df.Column1["Group1"]

Index1    0.536285
Index2   -0.174463
Index3    0.515365
Name: Column1, dtype: float64

In [461]:
df.Column1[["Group1","Group2"]] # Cift Parantez Onemli!

Group1  Index1    0.536285
        Index2   -0.174463
        Index3    0.515365
Group2  Index1   -0.184838
        Index2    0.392498
        Index3   -1.147811
Name: Column1, dtype: float64

In [463]:
df.Column1["Group1"].loc["Index1"]

0.5362851408304735

### Gruplari ve Indexleri Isimlendirmek

In [464]:
df.index.names

FrozenList([None, None])

In [466]:
df.index.names = ["Groups","Indexes"]

In [467]:
df

                 Column1   Column2   Column3
Groups Indexes
Group1 Index1   0.536285  0.705008  0.563368
       Index2  -0.174463 -0.433609  0.297974
       Index3   0.515365  0.072579  0.155913
Group2 Index1  -0.184838  0.621767 -0.196483
       Index2   0.392498 -1.167629 -0.780492
       Index3  -1.147811  0.187292  0.054348
Group3 Index1  -0.687919 -1.133465 -0.456514
       Index2   0.006300  1.214188 -0.903092
       Index3  -0.658737 -1.056317 -0.313451

In [470]:
df.loc["Group1"]

          Column1   Column2   Column3
Indexes
Index1   0.536285  0.705008  0.563368
Index2  -0.174463 -0.433609  0.297974
Index3   0.515365  0.072579  0.155913

#### xs metodu 
```
df.xs(key, axis=0, level=None, drop_level: 'bool_t' = True)
Docstring:
Return cross-section from the Series/DataFrame.

This method takes a `key` argument to select data at a particular
level of a MultiIndex.
```

In [471]:
df.xs("Group1")

          Column1   Column2   Column3
Indexes
Index1   0.536285  0.705008  0.563368
Index2  -0.174463 -0.433609  0.297974
Index3   0.515365  0.072579  0.155913

In [472]:
df.xs("Group1").xs("Index1")

Column1    0.536285
Column2    0.705008
Column3    0.563368
Name: Index1, dtype: float64

In [473]:
df.xs("Group1").xs("Index1").xs("Column1")

0.5362851408304735

__Tum Index1'leri dogrudan bir data Frame olarak Dondurmek istersek?__

In [474]:
df.xs("Index1",level="Indexes")

         Column1   Column2   Column3
Groups
Group1  0.536285  0.705008  0.563368
Group2 -0.184838  0.621767 -0.196483
Group3 -0.687919 -1.133465 -0.456514

## Missing Value'lar Ile Ugrasma

In [529]:
arr=np.array([[10,20,np.nan],[5,np.nan,np.nan],[21,np.nan,10]])
arr

array([[10., 20., nan],
       [ 5., nan, nan],
       [21., nan, 10.]])

In [530]:
df = pd.DataFrame(arr,index=["Index1","Index2","Index3"],columns=["Column1","Column2","Column3"])
df

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [531]:
df.dropna() # Default olarka axis 0 a bakar ve NaN Var ise orayi siler bizim her indexde oldugu icin tablo gidecektir.

Empty DataFrame
Columns: [Column1, Column2, Column3]
Index: []

In [532]:
df.dropna(axis=1)

        Column1
Index1     10.0
Index2      5.0
Index3     21.0

### dropna()
```
df.dropna(
    axis: 'Axis' = 0,
    how: 'str' = 'any',
    thresh=None,
    subset=None,
    inplace: 'bool' = False,
 ```
    
 __thresh__  parametresi ile sinir koyabiliriz   
 Orn: thresh=2 yaparak iki tane NaN Olmayan! Veri Var ise O Satiri silmiycek

In [533]:
df.dropna(thresh=2)

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index3     21.0      NaN     10.0

### fillna()
#### size() , sum() , isnull()
Bu Parametre ile __value__ vererek NaN lari verdigimiz deger ile doldurmasini soyleyebliriz.

In [534]:
df.fillna(value=1)

        Column1  Column2  Column3
Index1     10.0     20.0      1.0
Index2      5.0      1.0      1.0
Index3     21.0      1.0     10.0

Bazi durumlarda TUM degerlerin Veya O axisdeki degerlerin ortalamasini koymak isteyebiliriz ..

In [535]:
df.sum() # Default olarak axis 0 da toplar

Column1    36.0
Column2    20.0
Column3    10.0
dtype: float64

In [536]:
df.sum().sum()

66.0

In [537]:
df.size # Verimiz var NaN Dahil

9

In [538]:
df.isnull() # Kac NaN verimiz var?

        Column1  Column2  Column3
Index1    False    False     True
Index2    False     True     True
Index3    False     True    False

In [539]:
df.isnull().sum()

Column1    0
Column2    2
Column3    2
dtype: int64

In [540]:
df.isnull().sum().sum() # 4 NaN Degerimiz Var toplamda

4

In [541]:
def calculate_mean(df):
    total_sum=df.sum().sum() # Verilerin toplami
    total_num=df.size - df.isnull().sum().sum() # Normal veri sayisi 
    return (total_sum / total_num)

In [542]:
df.fillna(value = calculate_mean(df))

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

In [543]:
df # yine guncellenmedi

        Column1  Column2  Column3
Index1     10.0     20.0      NaN
Index2      5.0      NaN      NaN
Index3     21.0      NaN     10.0

In [544]:
df.fillna(value = calculate_mean(df),inplace=True)

In [545]:
df

        Column1  Column2  Column3
Index1     10.0     20.0     13.2
Index2      5.0     13.2     13.2
Index3     21.0     13.2     10.0

## GroupBy Operasyonlari

In [546]:
dataset = {
        "Departman":["Bilişim","İnsan Kaynakları","Üretim","Üretim","Bilişim","İnsan Kaynakları"],
        "Çalışan": ["Mustafa","Jale","Kadir","Zeynep","Murat","Ahmet"],
        "Maaş":[3000,3500,2500,4500,4000,2000]
        }

In [548]:
df=pd.DataFrame(dataset)
df

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [549]:
DepGroup=df.groupby("Departman")

In [550]:
DepGroup

In [555]:
DepGroup.sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [556]:
# Kisa yoldan
df.groupby("Departman").sum()

                  Maaş
Departman
Bilişim           7000
Üretim            7000
İnsan Kaynakları  5500

In [558]:
# Bilisimdeki toplam Maas?
DepGroup.sum().loc["Bilişim"]

Maaş    7000
Name: Bilişim, dtype: int64

### count()

In [559]:
DepGroup.count()

                  Çalışan  Maaş
Departman
Bilişim                 2     2
Üretim                  2     2
İnsan Kaynakları        2     2

### max()

In [561]:
DepGroup.max() # Departmanlarina gore EN yuksek maasli calisnlar

                  Çalışan  Maaş
Departman
Bilişim           Mustafa  4000
Üretim             Zeynep  4500
İnsan Kaynakları     Jale  3500

In [563]:
df # Ama mustafa 3000 Aliyor? 4000 alan Bilisimci Murat? . Demekki Maas Sutununu da Kendi icinde siraliyor

          Departman  Çalışan  Maaş
0           Bilişim  Mustafa  3000
1  İnsan Kaynakları     Jale  3500
2            Üretim    Kadir  2500
3            Üretim   Zeynep  4500
4           Bilişim    Murat  4000
5  İnsan Kaynakları    Ahmet  2000

In [564]:
df.groupby("Departman").max()["Maaş"]

Departman
Bilişim             4000
Üretim              4500
İnsan Kaynakları    3500
Name: Maaş, dtype: int64

In [565]:
df.groupby("Departman").max()["Maaş"]["Bilişim"]

4000

### mean()

In [566]:
df.groupby("Departman").mean()

                    Maaş
Departman
Bilişim           3500.0
Üretim            3500.0
İnsan Kaynakları  2750.0

In [568]:
df.groupby("Departman").mean()["Maaş"]["Bilişim"]

3500.0

## Concatenation
```
pd.concat(
    objs: 'Iterable[NDFrame] | Mapping[Hashable, NDFrame]',
    axis=0,
    join='outer',
    ignore_index: 'bool' = False,
    keys=None,
    levels=None,
    names=None,
    verify_integrity: 'bool' = False,
    sort: 'bool' = False,
    copy: 'bool' = True,
) -> 'FrameOrSeriesUnion'
```

In [571]:
dataset1 = {
    "A": ["A1","A2","A3","A4"],
    "B":["B1","B2","B3","B4"],
    "C":["C1","C2","C3","C4"],
}
dataset2 = {
    "A": ["A5","A6","A7","A8"],
    "B":["B5","B6","B7","B8"],
    "C":["C5","C6","C7","C8"],
}

In [572]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4])
df2 = pd.DataFrame(dataset2,index = [5,6,7,8] )

In [574]:
df1

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4

In [575]:
df2

    A   B   C
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [578]:
pd.concat([df1,df2])

    A   B   C
1  A1  B1  C1
2  A2  B2  C2
3  A3  B3  C3
4  A4  B4  C4
5  A5  B5  C5
6  A6  B6  C6
7  A7  B7  C7
8  A8  B8  C8

In [580]:
pd.concat([df1,df2],axis=1) # Demekki indexler missmatch oldu

     A    B    C    A    B    C
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3   A3   B3   C3  NaN  NaN  NaN
4   A4   B4   C4  NaN  NaN  NaN
5  NaN  NaN  NaN   A5   B5   C5
6  NaN  NaN  NaN   A6   B6   C6
7  NaN  NaN  NaN   A7   B7   C7
8  NaN  NaN  NaN   A8   B8   C8

## Join
```
df1.join(
    other: 'FrameOrSeriesUnion',
    on: 'IndexLabel | None' = None,
    how: 'str' = 'left',
    lsuffix: 'str' = '',
    rsuffix: 'str' = '',
    sort: 'bool' = False,
 ```

In [588]:
dataset1 = {
    "A" : ["A1","A2","A3","A4"],
    "B" : ["B1","B2","B3","A4"],
}
dataset2 = {
    "X" : ["X1","X2","X3"],
    "Y" : ["Y1","Y2","Y3"],
    
}

In [589]:
df1 = pd.DataFrame(dataset1,index = [1,2,3,4]) 
df2 = pd.DataFrame(dataset2,index = [1,2,3])

In [590]:
df1

    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  A4

In [591]:
df2

    X   Y
1  X1  Y1
2  X2  Y2
3  X3  Y3

In [593]:
df1.join(df2) # Default Olarak left join yapti

    A   B    X    Y
1  A1  B1   X1   Y1
2  A2  B2   X2   Y2
3  A3  B3   X3   Y3
4  A4  A4  NaN  NaN

In [595]:
df2.join(df1)

    X   Y   A   B
1  X1  Y1  A1  B1
2  X2  Y2  A2  B2
3  X3  Y3  A3  B3

## Merge
__Default olarak inner join yapar__

```
pd.merge(
    left: 'DataFrame | Series',
    right: 'DataFrame | Series',
    how: 'str' = 'inner',
    on: 'IndexLabel | None' = None,
    left_on: 'IndexLabel | None' = None,
    right_on: 'IndexLabel | None' = None,
    left_index: 'bool' = False,
    right_index: 'bool' = False,
    sort: 'bool' = False,
    suffixes: 'Suffixes' = ('_x', '_y'),
    copy: 'bool' = True,
    indicator: 'bool' = False,
    validate: 'str | None' = None,
 ```

In [601]:
dataset1 = {
    "A" : ["A1","A2","A3"],
    "B" : ["B1","B2","B3"],
    "anahtar" : ["K1","K2","K3"]
}
dataset2 = {
    "X" : ["X1","X2","X3","X4"],
    "Y" : ["Y1","Y2","Y3","Y4"],
    "anahtar" : ["K1","K2","K5","K4"]
}

In [602]:
df1 = pd.DataFrame(dataset1,index = [1,2,3]) 
df2 = pd.DataFrame(dataset2, index = [1,2,3,4])

In [603]:
df1

    A   B anahtar
1  A1  B1      K1
2  A2  B2      K2
3  A3  B3      K3

In [604]:
df2

    X   Y anahtar
1  X1  Y1      K1
2  X2  Y2      K2
3  X3  Y3      K5
4  X4  Y4      K4

In [608]:
pd.merge(df1,df2,how="inner",on="anahtar")

    A   B anahtar   X   Y
0  A1  B1      K1  X1  Y1
1  A2  B2      K2  X2  Y2

### Join ve Merge Farki

- merge Columnlar uzerinden Birlestirme islemi yapar
- Join indexler uzerinden Birlestirme yapar

## DataFrame Operasyonari

In [609]:
df = pd.DataFrame({
    "Column1":[1,2,3,4,5,6],
    "Column2":[100,100,200,300,300,100],
    "Column3":["Mustafa","Kamil","Emre","Ayşe","Murat","Zeynep"]
})

In [610]:
df

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

### head()

In [613]:
df.head(3) # 3 deger alir

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre

### unique() ve nunique()

In [622]:
df.Column2.unique()

array([100, 200, 300])

In [620]:
df.Column2.nunique()

3

### value_counts()

In [621]:
df.Column2.value_counts()

100    3
300    2
200    1
Name: Column2, dtype: int64

In [633]:
(df.Column1 >= 1) & (df.Column2 >= 300)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [632]:
df[(df.Column1 >= 1) & (df.Column2 >= 300)]

   Column1  Column2 Column3
3        4      300    Ayşe
4        5      300   Murat

### apply()
#### Fonksiyon ile Dataframe guncellemek

__Diyelimki Col2 deki elemanlari 3 ile carpmak ve df i guncellemek istiyoruz__

In [634]:
def times3(x):
    return x * 3

In [639]:
df.Column2.apply(times3)

0    300
1    300
2    600
3    900
4    900
5    300
Name: Column2, dtype: int64

In [641]:
df
# Guncellemek icin inplace parametresi tanimlanmamis.

   Column1  Column2  Column3
0        1      100  Mustafa
1        2      100    Kamil
2        3      200     Emre
3        4      300     Ayşe
4        5      300    Murat
5        6      100   Zeynep

In [642]:
df["Column2"] = df.Column2.apply(times3)

In [643]:
df

   Column1  Column2  Column3
0        1      300  Mustafa
1        2      300    Kamil
2        3      600     Emre
3        4      900     Ayşe
4        5      900    Murat
5        6      300   Zeynep

__lambda expressions da kullanilabilir__

In [646]:
df["Column2"]=df.Column2.apply(lambda x : x * 2)

In [647]:
df

   Column1  Column2  Column3
0        1      600  Mustafa
1        2      600    Kamil
2        3     1200     Emre
3        4     1800     Ayşe
4        5     1800    Murat
5        6      600   Zeynep

__Pythondaki gomulu fonksiyonlarda gonderilebilir.__

In [648]:
df.Column3.apply(len)

0    7
1    5
2    4
3    4
4    5
5    6
Name: Column3, dtype: int64

### columns , index , names

In [652]:
df

   Column1  Column2  Column3
0        1      600  Mustafa
1        2      600    Kamil
2        3     1200     Emre
3        4     1800     Ayşe
4        5     1800    Murat
5        6      600   Zeynep

In [650]:
df.columns

Index(['Column1', 'Column2', 'Column3'], dtype='object')

In [651]:
df.index

RangeIndex(start=0, stop=6, step=1)

In [653]:
len(df.index)

6

In [654]:
df.index.names

FrozenList([None])

### sort_values()
```
Signature:
df.sort_values(
    by,
    axis: 'Axis' = 0,
    ascending=True,
    inplace: 'bool' = False,
    kind: 'str' = 'quicksort',
    na_position: 'str' = 'last',
    ignore_index: 'bool' = False,
    key: 'ValueKeyFunc' = None,
```

In [657]:
df.sort_values("Column2")

   Column1  Column2  Column3
0        1      600  Mustafa
1        2      600    Kamil
5        6      600   Zeynep
2        3     1200     Emre
3        4     1800     Ayşe
4        5     1800    Murat

In [660]:
df.sort_values("Column2",ascending=False,inplace=True)
df

   Column1  Column2  Column3
3        4     1800     Ayşe
4        5     1800    Murat
2        3     1200     Emre
0        1      600  Mustafa
1        2      600    Kamil
5        6      600   Zeynep

## Pivot Tables

In [669]:
df = pd.DataFrame({
    "Ay" : ["Mart","Nisan","Mayıs","Mart","Nisan","Mayıs","Mart","Nisan","Mayıs"],
    "Sehir":["Ankara","Ankara","Ankara","İstanbul","İstanbul","İstanbul","İzmir","İzmir","İzmir"],
    "Nem":[10,25,50,21,67,80,30,70,75]
})

In [670]:
df

      Ay     Sehir  Nem
0   Mart    Ankara   10
1  Nisan    Ankara   25
2  Mayıs    Ankara   50
3   Mart  İstanbul   21
4  Nisan  İstanbul   67
5  Mayıs  İstanbul   80
6   Mart     İzmir   30
7  Nisan     İzmir   70
8  Mayıs     İzmir   75

### pivot_table()
```
Signature:
df.pivot_table(
    values=None,
    index=None,
    columns=None,
    aggfunc='mean',
    fill_value=None,
    margins=False,
    dropna=True,
    margins_name='All',
    observed=False,
    sort=True,
```

In [671]:
df.pivot_table(index= "Ay", columns="Sehir",values="Nem")

Sehir  Ankara  İstanbul  İzmir
Ay
Mart       10        21     30
Mayıs      50        80     75
Nisan      25        67     70

In [672]:
df.pivot_table(index= "Sehir", columns="Ay",values="Nem")

Ay        Mart  Mayıs  Nisan
Sehir
Ankara      10     50     25
İstanbul    21     80     67
İzmir       30     75     70